import and load dataset

In [1]:
import pandas as pd
import numpy as np
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace", "Hannah"],
    "Age": [24, 30, 22, 35, 29, 40, 28, 31],
    "Salary": [50000, 60000, 55000, 70000, 65000, 80000, 72000, 58000],
    "Department": ["HR", "Finance", "IT", "Marketing", "Finance", "IT", "HR", "Marketing"],
    "Rating": [4.5, 3.8, 4.0, 4.2, 3.9, 4.8, 4.1, 3.7]
}
df = pd.DataFrame(data)

DataFrame modifiation

In [ ]:
# insert a new column

#Straightforward way to insert a new column
df['Experience_Years'] = [2, 5, 1, 8, 4, 10, 3, 6] #This will add a new column at the end of the DataFrame
print(df.head(3))

print("\n")

# Using the insert method to add a new column at a specific position
df.insert(2, 'Location', ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'Philadelphia', 'San Antonio', 'San Diego'])
print(df.head(3))

      Name  Age     Location  Salary Department  Rating  Experience_Years
0    Alice   24     New York   50000         HR     4.5                 2
1      Bob   30  Los Angeles   60000    Finance     3.8                 5
2  Charlie   22      Chicago   55000         IT     4.0                 1


      Name  Age     Location  Salary Department  Rating  Experience_Years
0    Alice   24     New York   50000         HR     4.5                 2
1      Bob   30  Los Angeles   60000    Finance     3.8                 5
2  Charlie   22      Chicago   55000         IT     4.0                 1

In [8]:
# updating a single value in the DataFrame
df.at[0, 'Salary'] = 52000  # Update Alice's salary
df.loc[1, 'Rating'] = 4.1  # Update Bob's rating
print(df.head(3))

      Name  Age     Location  Salary Department  Rating  Experience_Years
0    Alice   24     New York   52000         HR     4.5                 2
1      Bob   30  Los Angeles   60000    Finance     4.1                 5
2  Charlie   22      Chicago   55000         IT     4.0                 1

In [9]:
# updating a column
df['Salary'] = df['Salary'] * 1.1  # Increase all salaries by 10%
print(df.head(5))

      Name  Age     Location   Salary Department  Rating  Experience_Years
0    Alice   24     New York  57200.0         HR     4.5                 2
1      Bob   30  Los Angeles  66000.0    Finance     4.1                 5
2  Charlie   22      Chicago  60500.0         IT     4.0                 1
3    David   35      Houston  77000.0  Marketing     4.2                 8
4      Eve   29      Phoenix  71500.0    Finance     3.9                 4

In [10]:
# drop columns
df.drop(columns=['Experience_Years', 'Location'], inplace=True)  # Drop the columns we just added
# here inplace=True means that the changes will be applied to the original DataFrame
print(df.head(3))

      Name  Age   Salary Department  Rating
0    Alice   24  57200.0         HR     4.5
1      Bob   30  66000.0    Finance     4.1
2  Charlie   22  60500.0         IT     4.0